# Задание 1.  Поработайте с переменными, создайте несколько, выведите на экран.
# Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.

name = input("Hello! Please enter your name: ")
location = input("Where are you from? Please write here: ")
number = int(input("Enter any number: "))
print(f"Your name: {name}, you are from {location}, your number is {number}.")

